;; ************************************************************************* ;;
;;                                                                           ;;
;;  test_codebase_cobol.txt                              TTTTTTTT SSSSSSS II ;;
;;                                                          TT    SS      II ;;
;;  By: st93642@students.tsi.lv                             TT    SSSSSSS II ;;
;;                                                          TT         SS II ;;
;;  Created: Sep 25 2025 18:20 Igors Oleinikovs             TT    SSSSSSS II ;;
;;  Updated: Sep 25 2025 18:20 Igors Oleinikovs                              ;;
;;                                                                           ;;
;;   Transport and Telecommunication Institute - Riga, Latvia                ;;
;;                       https://tsi.lv                                      ;;
;; ************************************************************************* ;;

      * Basic COBOL program
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. TSI-STUDENT.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-MESSAGE         PIC X(50) VALUE 'Hello, World!'.
       01  WS-PROGRAM         PIC X(50) VALUE 'This is a basic COBOL program.'.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY WS-MESSAGE.
           DISPLAY WS-PROGRAM.
           
           STOP RUN.
           
       END PROGRAM HELLO-WORLD.

      * Example subroutine (uncomment to use)
      * IDENTIFICATION DIVISION.
      * PROGRAM-ID. GREET.
      * 
      * DATA DIVISION.
      * LINKAGE SECTION.
      * 01  LS-NAME            PIC X(20).
      * 
      * PROCEDURE DIVISION USING LS-NAME.
      *     DISPLAY 'Hello, ' LS-NAME '!'.
      *     EXIT PROGRAM.
      * END PROGRAM GREET.
